# MPG Cars

### Introduction:

The following exercise utilizes data from [UC Irvine Machine Learning Repository](https://archive.ics.uci.edu/ml/datasets/Auto+MPG)

### Step 1. Import the necessary libraries

In [15]:
import pandas as pd
import numpy as np

### Step 2. Import the first dataset [cars1](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv) and [cars2](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv).

   ### Step 3. Assign each to a variable called cars1 and cars2

In [5]:
cars1 = pd.read_csv("cars1.csv")
cars2 = pd.read_csv("cars2.csv")

### Step 4. Oops, it seems our first dataset has some unnamed blank columns, fix cars1

In [6]:
cars1.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,NaN,NaN,NaN,NaN,NaN
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,NaN,NaN,NaN,NaN,NaN
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite,NaN,NaN,NaN,NaN,NaN
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst,NaN,NaN,NaN,NaN,NaN
4,17.0,8,302,140,3449,10.5,70,1,ford torino,NaN,NaN,NaN,NaN,NaN

In [7]:
cars2.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,33.0,4,91,53,1795,17.4,76,3,honda civic
1,20.0,6,225,100,3651,17.7,76,1,dodge aspen se
2,18.0,6,250,78,3574,21.0,76,1,ford granada ghia
3,18.5,6,250,110,3645,16.2,76,1,pontiac ventura sj
4,17.5,6,258,95,3193,17.8,76,1,amc pacer d/l

In [8]:
cars1 = cars1.loc[:, "mpg":"car"]
cars1.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino

### Step 5. What is the number of observations in each dataset?

In [11]:
cars1.shape

(198, 9)

In [10]:
cars2.shape

(200, 9)

### Step 6. Join cars1 and cars2 into a single DataFrame called cars

In [12]:
cars = pd.concat([cars1, cars2])

In [14]:
cars.shape

(398, 9)

### Step 7. Oops, there is a column missing, called owners. Create a random number Series from 15,000 to 73,000.

In [17]:
owners =  np.random.randint(low=15000, high=73001, size= 398, dtype="l")

In [18]:
owners

array([23377, 26379, 38893, 34503, 42643, 17054, 48237, 59106, 44502,
       37219, 70800, 59406, 69066, 60140, 20458, 71802, 44646, 35008,
       69099, 27872, 35190, 39796, 19951, 30256, 44062, 19297, 54682,
       58562, 48873, 21794, 47056, 62704, 35681, 20149, 29101, 69354,
       37866, 15282, 27554, 27703, 44887, 70719, 22106, 50019, 17502,
       25601, 16083, 62661, 44370, 27076, 22029, 60617, 27236, 39762,
       61434, 49552, 32875, 44414, 16567, 18171, 45729, 67189, 23453,
       52745, 42338, 26447, 52963, 43219, 70345, 16399, 30949, 36975,
       35188, 52167, 67132, 59199, 67692, 58362, 66527, 22536, 47236,
       28914, 34804, 57578, 17511, 65532, 39802, 31994, 20634, 64954,
       54207, 36327, 42179, 70624, 41398, 26975, 43592, 43704, 51132,
       45337, 65070, 43240, 49220, 59331, 31473, 18309, 68604, 22211,
       24505, 69734, 58896, 21306, 53887, 40846, 48221, 57394, 48523,
       66985, 58442, 51545, 63214, 62409, 44770, 16954, 30377, 27568,
       52391, 33713, 15367, 37533, 37745, 59914, 30101, 23168, 19453,
       28228, 41315, 57726, 22163, 44338, 52875, 66532, 31185, 32799,
       42246, 36273, 58516, 40784, 60475, 24460, 65761, 15001, 23016,
       70312, 39444, 25000, 43106, 71899, 43024, 30019, 15466, 51290,
       60018, 66125, 24286, 34941, 66738, 70706, 41644, 30011, 15319,
       71785, 24606, 49991, 57341, 18274, 57642, 27371, 22685, 71319,
       15622, 20667, 31378, 21282, 69012, 56763, 46489, 71187, 40338,
       66268, 57381, 63836, 26078, 39074, 55434, 64592, 37307, 65837,
       62704, 34430, 35120, 44542, 24592, 32639, 27348, 45757, 28192,
       40372, 65553, 54822, 58279, 30871, 46293, 26927, 57202, 60312,
       57615, 30961, 22939, 34287, 50132, 62323, 46039, 58120, 46724,
       56911, 33435, 36433, 22135, 40574, 63401, 20529, 30646, 16022,
       60116, 71408, 67996, 22327, 63543, 56690, 15799, 38957, 67462,
       54594, 26218, 55726, 35264, 18752, 24831, 19790, 17675, 37867,
       69728, 72797, 31026, 49182, 46016, 70633, 26483, 27154, 63787,
       56777, 63941, 56244, 15494, 61171, 24738, 25720, 31957, 50325,
       61083, 70318, 64985, 58109, 46574, 52095, 24297, 20477, 52647,
       70832, 35227, 34407, 16846, 34079, 26508, 60160, 32108, 24373,
       63497, 70827, 53177, 42819, 60281, 32226, 25117, 19667, 36420,
       70587, 52436, 46501, 43430, 21019, 68972, 29211, 49509, 63499,
       36493, 68885, 56169, 61985, 35066, 52249, 53751, 28547, 51182,
       70479, 33646, 66739, 37993, 16859, 46388, 41503, 25852, 24534,
       33928, 24100, 47760, 56319, 71252, 42096, 57601, 64738, 38691,
       65231, 52216, 65962, 45452, 37297, 39734, 70459, 19193, 19510,
       52483, 24882, 21499, 63750, 41898, 20361, 19730, 19548, 36860,
       48102, 25358, 39935, 61479, 18959, 52999, 65451, 15602, 26970,
       29059, 46105, 23568, 48464, 16825, 42266, 65478, 42967, 21775,
       46278, 20579, 67612, 61107, 59236, 26429, 53770, 24487, 16975,
       45242, 33877, 70953, 46958, 68539, 19690, 35142, 34588, 33607,
       68540, 58142, 31374, 63715, 46406, 19616, 71302, 71899, 61840,
       39821, 49902])

### Step 8. Add the column owners to cars

In [20]:
cars["owners"] = owners

In [21]:
cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,owners
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,23377
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,26379
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite,38893
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst,34503
4,17.0,8,302,140,3449,10.5,70,1,ford torino,42643